In [35]:
import numpy as np
import pandas as pd

In [36]:
titanic_df = pd.read_csv(".\\data\\titanic.csv")

PassengerId - 승객 고유번호
Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
Name - 탑승객 성명
Sex - 성별 (male: 남성, female: 여성)
Age - 나이(세)
SibSp - 함께 탑승한 형제자매, 배우자 수 총합
Parch - 함께 탑승한 부모, 자녀 수 총합
Ticket - 티켓 넘버
Fare - 탑승 요금
Cabin - 객실 넘버
Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [37]:
titanic_df.describe(include = 'all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Dooley, Mr. Patrick",male,NaN,NaN,NaN,347082,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

### 기본 문제

In [38]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
dead = len(titanic_df[titanic_df['Survived'] == 0])
Survival  = len(titanic_df) - dead

print(f'생존자: {Survival}, 사망자: {dead}')
# survival = titanic_df[titanic_df['PassengerId']== 1].count()

생존자: 342, 사망자: 549

In [39]:
# dead = titanic_df[titanic_df['Survived'] ==0].value_counts()

In [40]:
# 2. 승객 나이의 평균 출력
print(titanic_df['Age'].mean().round())

30.0

In [41]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
first_class = titanic_df[titanic_df['Pclass'] == 1]

print(first_class['Fare'].max())

512.3292

In [42]:
# 4. 여성 승객의 수를 구하여 출력
Female = titanic_df['Sex'] == 'female'
print(Female.sum())

314

In [43]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력

filtered_df = titanic_df[titanic_df['Fare'] >=50][['Name','Fare']]
print(filtered_df)

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [44]:
#  6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
filtered_df = titanic_df[titanic_df['Age'] < 18]
survival_rate = len(filtered_df[filtered_df['Survived'] == 1]) / len(filtered_df) * 100
print(f'생존율 {survival_rate}')

#  61/ 113

생존율 53.98230088495575

In [45]:
# - 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
second_rider = titanic_df[titanic_df['Pclass'] == 2]['Fare'].mean()
print(second_rider)

20.662183152173913

In [46]:
# - 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
Age_sort = titanic_df.sort_values(['Age'],ascending=False)
oldest_passenger = Age_sort.iloc[0]
print(oldest_passenger['Name'], oldest_passenger['Age'])

Barkworth, Mr. Algernon Henry Wilson 80.0

In [47]:
# - 9. S 항구에서 탑승한 승객의 수를 출력
five_gate = titanic_df[titanic_df['Embarked'] == 'S']
print(len(five_gate))

644

In [52]:
# - 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
filtered_data = titanic_df[(titanic_df['Pclass']==3) | (titanic_df['Sex']=='Male') | (titanic_df['Survived'] == 1)]
len(filtered_data)

714

-----------

## 고급 문제

In [55]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
titanic_df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [79]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
grouping = titanic_df.groupby('SibSp')[['Name','Fare','Age']].filter(lambda x: len(x)>=  3)
grouping.sort_values(by='Fare', ascending=False).head(5)

                                   Name      Fare   Age
679  Cardeza, Mr. Thomas Drake Martinez  512.3292  36.0
258                    Ward, Miss. Anna  512.3292  35.0
737              Lesurer, Mr. Gustave J  512.3292  35.0
88           Fortune, Miss. Mabel Helen  263.0000  23.0
438                   Fortune, Mr. Mark  263.0000  64.0

In [121]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
# age 결측값인 사람
# 탑승항구 그룹화
# 수 출력

# Zero_age = titanic_df[titanic_df['Age'].isnull()]

titanic_df[titanic_df['Age'].isnull()].groupby('Embarked').count()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
Embarked,,,,,,,,,,,
C,38,38,38,38,38,0,38,38,38,38,4
Q,49,49,49,49,49,0,49,49,49,49,2
S,90,90,90,90,90,0,90,90,90,90,13

In [131]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력
titanic_df[(titanic_df['Age'] < 16) & (titanic_df['SibSp'] == 0) & (titanic_df['Parch'] == 0)][['Name', 'Sex', 'Survived']]

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [133]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
titanic_df[ (titanic_df['Pclass'] == 1) &  (titanic_df['Fare'] > titanic_df['Fare'].mean())][['Name', 'Age', 'Fare']]

                                                  Name   Age      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   53.1000
6                              McCarthy, Mr. Timothy J  54.0   51.8625
23                        Sloper, Mr. William Thompson  28.0   35.5000
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
..                                                 ...   ...       ...
853                          Lines, Miss. Mary Conover  16.0   39.4000
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667
867               Roebling, Mr. Washington Augustus II  31.0   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0   83.1583

[159 rows x 3 columns]

In [141]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
titanic_df[['Age', 'Pclass', 'Fare']].notna().groupby("Pclass")['Fare'].agg(['mean', 'median'])

        mean  median
Pclass
True     1.0     1.0

In [151]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
print(titanic_df.groupby('Embarked')['Age'].mean())
titanic_df['Embarked'].sort_values(ascending=False)

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64

[1.0]

In [166]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

# print(len(filtering['Survived'] == 1) / len(filtering))
filtering_df = titanic_df[(titanic_df['Sex'] =='female') & (titanic_df['Age'] >= 30)]

# 생존율
len(filtering_df[filtering_df['Survived']==1]) / len(filtering_df)

0.19298245614035087

In [169]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력
filter_df = titanic_df[titanic_df['SibSp'] + titanic_df['Parch'] >= 3]

# 생존율
len(filter_df[filter_df['Survived']==1]) / len(filter_df)

0.34065934065934067

In [190]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
titanic_df['Cabin'] = titanic_df['Cabin'].dropna()

# 객실 번호 정보 잇는 승객 명수: 891
total = len(titanic_df['Cabin'])

# 객실 등급별 생존자 
survival = titanic_df.groupby('Pclass')['Survived'].sum()
print(survival)

# 생존률
print(f"1st: {survival[1]/total*100}, 2nd: {survival[2]/total*100}, 3th: {survival[3]/total*100}")

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64
1st: 15.26374859708193, 2nd: 9.764309764309765, 3th: 13.35578002244669